modules/gateway/gateway-api/src/test/resources/com/l7tech/gateway/api/testMessages/Service_PutDetails_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management"
              xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes"
              xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex"
              xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
              xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
              xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
              xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
              xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd"
              xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema">
    <env:Header>
        <wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/01/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</wsa:Action>
        <wsman:FragmentTransfer Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" env:mustUnderstand="true"
                                xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management">l7:ServiceDetail</wsman:FragmentTransfer>
        <wsa:MessageID env:mustUnderstand="true">uuid:98d7f385-e07f-47ee-8d4a-df86012ce34c</wsa:MessageID>
        <wsa:RelatesTo>uuid:4502f891-1453-4c50-8b35-a3ced2f3a6a9</wsa:RelatesTo>
        <wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    </env:Header>
    <env:Body xmlns:ns9="http://ns.l7tech.com/2010/01/gateway-management">
        <wsman:XmlFragment>
            <ns9:ServiceDetail id="229376" version="52" xmlns="">
                <ns9:Name>Warehouse</ns9:Name>
                <ns9:Enabled>false</ns9:Enabled>
                <ns9:ServiceMappings>
                    <ns9:HttpMapping>
                        <ns9:Verbs>
                            <ns9:Verb>POST</ns9:Verb>
                        </ns9:Verbs>
                    </ns9:HttpMapping>
                    <ns9:SoapMapping>
                        <ns9:Lax>false</ns9:Lax>
                    </ns9:SoapMapping>
                </ns9:ServiceMappings>
                <ns9:Properties>
                    <ns9:Property key="policyRevision">
                        <ns9:LongValue>1383</ns9:LongValue>
                    </ns9:Property>
                    <ns9:Property key="wssProcessingEnabled">
                        <ns9:BooleanValue>true</ns9:BooleanValue>
                    </ns9:Property>
                    <ns9:Property key="soap">
                        <ns9:BooleanValue>true</ns9:BooleanValue>
                    </ns9:Property>
                    <ns9:Property key="internal">
                        <ns9:BooleanValue>false</ns9:BooleanValue>
                    </ns9:Property>
                </ns9:Properties>
            </ns9:ServiceDetail>
        </wsman:XmlFragment>
    </env:Body>
</env:Envelope>